solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_XSPI.h
/*! @name IPEDCTXIV - IPED Context Initial Vector */
/*! @{ */

#define XSPI_IPEDCTXIV_CTX_IV_MASK               (0xFFFFFFFFU)
#define XSPI_IPEDCTXIV_CTX_IV_SHIFT              (0U)
/*! CTX_IV - 32 bits of IV for the context region */
#define XSPI_IPEDCTXIV_CTX_IV(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXIV_CTX_IV_SHIFT)) & XSPI_IPEDCTXIV_CTX_IV_MASK)
/*! @} */

/* The count of XSPI_IPEDCTXIV */
#define XSPI_IPEDCTXIV_COUNT                     (16U)

/* The count of XSPI_IPEDCTXIV */
#define XSPI_IPEDCTXIV_COUNT2                    (2U)

/*! @name IPEDCTXSTART - IPED Start Address Region */
/*! @{ */

#define XSPI_IPEDCTXSTART_GCM_MASK               (0x1U)
#define XSPI_IPEDCTXSTART_GCM_SHIFT              (0U)
/*! GCM - GCM Mode Region
 *  0b0..CTR
 *  0b1..GCM
 */
#define XSPI_IPEDCTXSTART_GCM(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXSTART_GCM_SHIFT)) & XSPI_IPEDCTXSTART_GCM_MASK)

#define XSPI_IPEDCTXSTART_SADD_MASK              (0xFFFFFF00U)
#define XSPI_IPEDCTXSTART_SADD_SHIFT             (8U)
/*! SADD - Start Address */
#define XSPI_IPEDCTXSTART_SADD(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXSTART_SADD_SHIFT)) & XSPI_IPEDCTXSTART_SADD_MASK)
/*! @} */

/* The count of XSPI_IPEDCTXSTART */
#define XSPI_IPEDCTXSTART_COUNT                  (16U)

/*! @name IPEDCTXEND - IPED End Address Region */
/*! @{ */

#define XSPI_IPEDCTXEND_END_ADDRESS_MASK         (0xFFFFFF00U)
#define XSPI_IPEDCTXEND_END_ADDRESS_SHIFT        (8U)
/*! END_ADDRESS - End Address */
#define XSPI_IPEDCTXEND_END_ADDRESS(x)           (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXEND_END_ADDRESS_SHIFT)) & XSPI_IPEDCTXEND_END_ADDRESS_MASK)
/*! @} */

/* The count of XSPI_IPEDCTXEND */
#define XSPI_IPEDCTXEND_COUNT                    (16U)

/*! @name IPEDCTXAAD - IPED Context Additional Authentication Data */
/*! @{ */

#define XSPI_IPEDCTXAAD_CTX_AAD_MASK             (0xFFFFFFFFU)
#define XSPI_IPEDCTXAAD_CTX_AAD_SHIFT            (0U)
/*! CTX_AAD - 32 bits of AAD for the region */
#define XSPI_IPEDCTXAAD_CTX_AAD(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTXAAD_CTX_AAD_SHIFT)) & XSPI_IPEDCTXAAD_CTX_AAD_MASK)
/*! @} */

/* The count of XSPI_IPEDCTXAAD */
#define XSPI_IPEDCTXAAD_COUNT                    (16U)

/* The count of XSPI_IPEDCTXAAD */
#define XSPI_IPEDCTXAAD_COUNT2                   (2U)

/*! @name IPEDCTRL - IPED Function Control */
/*! @{ */

#define XSPI_IPEDCTRL_CONFIG_MASK                (0x1U)
#define XSPI_IPEDCTRL_CONFIG_SHIFT               (0U)
/*! CONFIG - IPED CTR/GCM Interface Configure
 *  0b0..Prince 12 rounds
 *  0b1..Prince 22 rounds
 */
#define XSPI_IPEDCTRL_CONFIG(x)                  (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_CONFIG_SHIFT)) & XSPI_IPEDCTRL_CONFIG_MASK)

#define XSPI_IPEDCTRL_IPED_EN_MASK               (0x2U)
#define XSPI_IPEDCTRL_IPED_EN_SHIFT              (1U)
/*! IPED_EN - IPED CTR-GCM Interface Enable
 *  0b0..Bypasses IPED logic and allows writing of unencrypted or undecrypted data
 *  0b1..Enables
 */
#define XSPI_IPEDCTRL_IPED_EN(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_IPED_EN_SHIFT)) & XSPI_IPEDCTRL_IPED_EN_MASK)

#define XSPI_IPEDCTRL_IPWR_EN_MASK               (0x4U)
#define XSPI_IPEDCTRL_IPWR_EN_SHIFT              (2U)
/*! IPWR_EN - IP Write IPED XEX or CTR Mode Enable
 *  0b0..Bypasses IPS-based data and writes unencrypted data
 *  0b1..Enables
 */
#define XSPI_IPEDCTRL_IPWR_EN(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_IPWR_EN_SHIFT)) & XSPI_IPEDCTRL_IPWR_EN_MASK)

#define XSPI_IPEDCTRL_AHBWR_EN_MASK              (0x8U)
#define XSPI_IPEDCTRL_AHBWR_EN_SHIFT             (3U)
/*! AHBWR_EN - AHB Write IPED XEX or CTR Mode Encryption Enable
 *  0b0..Bypasses AHB-based data and writes unencrypted
 *  0b1..Enables
 */
#define XSPI_IPEDCTRL_AHBWR_EN(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_AHBWR_EN_SHIFT)) & XSPI_IPEDCTRL_AHBWR_EN_MASK)

#define XSPI_IPEDCTRL_AHBRD_EN_MASK              (0x10U)
#define XSPI_IPEDCTRL_AHBRD_EN_SHIFT             (4U)
/*! AHBRD_EN - AHB Read IPED XEX or CTR Mode Decryption Enable
 *  0b0..Bypasses AHB-based data and reads unencrypted
 *  0b1..Enables
 */
#define XSPI_IPEDCTRL_AHBRD_EN(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_AHBRD_EN_SHIFT)) & XSPI_IPEDCTRL_AHBRD_EN_MASK)

#define XSPI_IPEDCTRL_IPGCMWR_MASK               (0x40U)
#define XSPI_IPEDCTRL_IPGCMWR_SHIFT              (6U)
/*! IPGCMWR - IP Write GCM Enable
 *  0b0..Bypasses IPS-based data and writes unencrypted data
 *  0b1..Enables
 */
#define XSPI_IPEDCTRL_IPGCMWR(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_IPGCMWR_SHIFT)) & XSPI_IPEDCTRL_IPGCMWR_MASK)

#define XSPI_IPEDCTRL_AHGCMWR_MASK               (0x80U)
#define XSPI_IPEDCTRL_AHGCMWR_SHIFT              (7U)
/*! AHGCMWR - AHB Write IPED GCM Encryption Enable
 *  0b0..Bypasses AHB data and writes unencrypted data
 *  0b1..Enables
 */
#define XSPI_IPEDCTRL_AHGCMWR(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_AHGCMWR_SHIFT)) & XSPI_IPEDCTRL_AHGCMWR_MASK)

#define XSPI_IPEDCTRL_AHBGCMRD_MASK              (0x100U)
#define XSPI_IPEDCTRL_AHBGCMRD_SHIFT             (8U)
/*! AHBGCMRD - AHB Read IPED GCM Decryption Enable
 *  0b0..Bypasses AHB data and reads unencrypted data
 *  0b1..Enables
 */
#define XSPI_IPEDCTRL_AHBGCMRD(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_AHBGCMRD_SHIFT)) & XSPI_IPEDCTRL_AHBGCMRD_MASK)

#define XSPI_IPEDCTRL_IPED_PROTECT_MASK          (0x200U)
#define XSPI_IPEDCTRL_IPED_PROTECT_SHIFT         (9U)
/*! IPED_PROTECT - IPED Protection
 *  0b0..Disables
 *  0b1..Enables
 */
#define XSPI_IPEDCTRL_IPED_PROTECT(x)            (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_IPED_PROTECT_SHIFT)) & XSPI_IPEDCTRL_IPED_PROTECT_MASK)

#define XSPI_IPEDCTRL_IPED_SWRESET_MASK          (0x400U)
#define XSPI_IPEDCTRL_IPED_SWRESET_SHIFT         (10U)
/*! IPED_SWRESET - IPED CTR/GCM and XEX Interface Software Reset
 *  0b0..No reset
 *  0b1..Resets
 */
#define XSPI_IPEDCTRL_IPED_SWRESET(x)            (((uint32_t)(((uint32_t)(x)) << XSPI_IPEDCTRL_IPED_SWRESET_SHIFT)) & XSPI_IPEDCTRL_IPED_SWRESET_MASK)

